Repository: Bobsans/VibeMQ
Catalog: docs/locale/*/LC_MESSAGES/docs/architecture.po
Languages: ru

source: Architecture
ru: Архитектура

source: This guide describes the internal architecture of VibeMQ and its operating principles.
ru: В этом руководстве описывается внутренняя архитектура VibeMQ и принципы его работы.

source: Contents
ru: Содержание

source: Architecture Overview
ru: Обзор архитектуры

source: VibeMQ is built on a modular principle and consists of several independent components that interact through clearly defined interfaces.
ru: VibeMQ построен по модульному принципу и состоит из нескольких независимых компонентов, взаимодействующих через четко определенные интерфейсы.

source: System Components
ru: Компоненты системы

source: **Purpose:** Basic models, interfaces, and configuration.
ru: **Цель:** Базовые модели, интерфейсы и конфигурации.

source: **Main types:**
ru: **Основные типы:**

source: Type
ru: Тип

source: Description
ru: Описание

source: Broker message model
ru: Модель сообщения брокера

source: Queue state information
ru: Информация о состоянии очереди

source: Server configuration
ru: Конфигурация сервера

source: Queue settings
ru: Настройки очереди

source: Client settings
ru: Настройки клиента

source: Queue management interface
ru: Интерфейс управления очередью

source: Message store interface
ru: Интерфейс хранилища сообщений

source: ``IAuthenticationService`` | Authentication interface
ru: ``IAuthenticationService`` | Интерфейс аутентификации

source: Metrics collection interface
ru: Интерфейс сбора метрик

source: **Enumerations:**
ru: **Нумерации:**

source: ``DeliveryMode`` — delivery mode (RoundRobin, FanOut, Priority)
ru: ``DeliveryMode`` — режим доставки (RoundRobin, FanOut, Priority)

source: ``MessagePriority`` — message priority (Low, Normal, High, Critical)
ru: ``MessagePriority`` — приоритет сообщения (Низкий, Нормальный, Высокий, Критический)

source: ``OverflowStrategy`` — overflow strategy
ru: ``OverflowStrategy`` — стратегия переполнения

source: ``FailureReason`` — failure reason
ru: ``FailureReason`` — причина сбоя

source: ``CommandType`` — protocol command type
ru: ``CommandType`` — тип команды протокола

source: VibeMQ.Protocol
ru: VibeMQ.Протокол

source: **Purpose:** Message serialization and TCP transmission.
ru: **Цель:** сериализация сообщений и передача TCP.

source: **Framing:**
ru: **Кадр:**

source: Uses length-prefix approach for message separation in TCP stream:
ru: Использует подход с префиксом длины для разделения сообщений в потоке TCP:

source: **Components:**
ru: **Компоненты:**

source: ``FrameReader`` — read frames from stream
ru: ``FrameReader`` — прочитать кадры из потока

source: ``FrameWriter`` — write frames to stream
ru: ``FrameWriter`` — запись кадров в поток

source: ``WriteBatcher`` — message batching for performance
ru: ``WriteBatcher`` — пакетирование сообщений для повышения производительности

source: ``ProtocolMessage`` — base class for protocol message
ru: ``ProtocolMessage`` — базовый класс для сообщения протокола

source: **Message format:**
ru: **Формат сообщения:**

source: VibeMQ.Server
ru: VibeMQ.Сервер

source: **Purpose:** Broker server implementation.
ru: **Цель:** Реализация брокерского сервера.

source: **Key components:**
ru: **Основные компоненты:**

source: **BrokerServer** — main server class:
ru: **BrokerServer** — основной класс сервера:

source: **BrokerBuilder** — Fluent API for configuration:
ru: **BrokerBuilder** — Свободный API для настройки:

source: **QueueManager** — queue management:
ru: **QueueManager** — управление очередью:

source: Queue creation and deletion
ru: Создание и удаление очереди

source: Message publishing
ru: Публикация сообщений

source: Client subscription and unsubscription
ru: Подписка и отписка клиента

source: Message acknowledgment
ru: Подтверждение сообщения

source: **ConnectionManager** — connection management:
ru: **ConnectionManager** — управление соединениями:

source: Active connection tracking
ru: Активное отслеживание соединений

source: Message routing to subscribers
ru: Маршрутизация сообщений подписчикам

source: Connection lifecycle management
ru: Управление жизненным циклом соединения

source: **CommandDispatcher** — command handling:
ru: **CommandDispatcher** — обработка команд:

source: ``ConnectHandler`` — connection establishment
ru: ``ConnectHandler`` — установление соединения

source: ``PublishHandler`` — message publishing
ru: ``PublishHandler`` — публикация сообщения

source: ``SubscribeHandler`` — queue subscription
ru: ``SubscribeHandler`` — подписка на очередь

source: ``UnsubscribeHandler`` — queue unsubscription
ru: ``UnsubscribeHandler`` — отписка от очереди

source: ``AckHandler`` — acknowledgment handling
ru: ``AckHandler`` — обработка подтверждения

source: ``PingHandler`` — keep-alive
ru: ``PingHandler`` — поддерживать активность

source: **AckTracker** — acknowledgment tracking:
ru: **AckTracker** — отслеживание подтверждений:

source: Unacknowledged message tracking
ru: Отслеживание неподтвержденных сообщений

source: Timeouts and retry attempts
ru: Тайм-ауты и повторные попытки

source: Exponential backoff between retries
ru: Экспоненциальная задержка между повторными попытками

source: **DeadLetterQueue** — failed message queue:
ru: **DeadLetterQueue** — очередь сообщений с ошибкой:

source: Store messages with failed delivery
ru: Хранить сообщения с неудачной доставкой

source: Re-processing mechanism
ru: Механизм повторной обработки

source: **RateLimiter** — rate limiting:
ru: **RateLimiter** — ограничение скорости:

source: IP-based rate limiting for connections
ru: Ограничение скорости соединений на основе IP

source: Client-based rate limiting for messages
ru: Ограничение скорости сообщений на основе клиента

source: VibeMQ.Client
ru: VibeMQ.Клиент

source: **Purpose:** Client for broker connection.
ru: **Назначение:** Клиент для подключения брокера.

source: **VibeMQClient** — main client class:
ru: **VibeMQClient** — основной клиентский класс:

source: **ReconnectPolicy** — reconnection policy:
ru: **ReconnectPolicy** — политика переподключения:

source: **Purpose:** HTTP server for health checks.
ru: **Цель:** HTTP-сервер для проверки работоспособности.

source: **HealthCheckServer** — HTTP server:
ru: **HealthCheckServer** — HTTP-сервер:

source: **Endpoints:**
ru: **Конечные точки:**

source: ``GET /health/`` — health status (200 OK or 503)
ru: ``GET /health/`` — состояние здоровья (200 ОК или 503)

source: ``GET /metrics/`` — broker metrics (JSON)
ru: ``GET /metrics/`` — метрики брокера (JSON)

source: **HealthStatus** — health status:
ru: **HealthStatus** — состояние здоровья:

source: Operating Principles
ru: Принципы работы

source: Message Lifecycle
ru: Жизненный цикл сообщения

source: **Publishing:**
ru: **Издательский:**

source: Client sends ``Publish`` command
ru: Клиент отправляет команду ``Publish``

source: Server validates message
ru: Сервер проверяет сообщение

source: Message is stored in queue
ru: Сообщение сохраняется в очереди

source: ``PublishAck`` confirmation is sent
ru: ``PublishAck`` подтверждение отправлено

source: **Routing:**
ru: **Маршрутизация:**

source: ``QueueManager`` determines delivery mode
ru: ``QueueManager`` определяет режим доставки

source: For Round-robin, next subscriber is selected
ru: В циклическом режиме выбирается следующий абонент.

source: For Fan-out, message is copied to all subscribers
ru: При разветвлении сообщение копируется всем подписчикам.

source: For Priority-based, sorted by priority
ru: Для На основе приоритета, отсортировано по приоритету

source: **Delivery:**
ru: **Доставка:**

source: Message is sent to subscriber via ``Deliver`` command
ru: Сообщение отправляется подписчику с помощью команды ``Deliver``.

source: ACK wait timer is started
ru: Таймер ожидания ACK запущен

source: Message is marked as "in-flight"
ru: Сообщение помечено как «в работе»

source: **Acknowledgment:**
ru: **Признание:**

source: Subscriber sends ``Ack`` command
ru: Абонент отправляет команду ``Ack``

source: ``AckTracker`` marks message as delivered
ru: ``AckTracker`` отмечает сообщение как доставленное

source: Message is removed from in-flight
ru: Сообщение удалено из раздела "В полете"

source: Metrics are updated
ru: Метрики обновляются

source: **Retry (if no ACK):**
ru: **Повторить попытку (если нет подтверждения):**

source: Timer expires
ru: Таймер истекает

source: Attempt counter is incremented
ru: Счетчик попыток увеличивается

source: If attempts not exhausted — resend
ru: Если попытки не исчерпаны — отправьте повторно

source: If exhausted — move to Dead Letter Queue
ru: Если исчерпаны — перейдите в очередь недоставленных писем.

source: Delivery Modes
ru: Способы доставки

source: **Round-robin:**
ru: **Круговой алгоритм:**

source: Each message is delivered to one subscriber cyclically.
ru: Каждое сообщение доставляется одному абоненту циклически.

source: **Fan-out with acknowledgment:**
ru: **Разветвление с подтверждением:**

source: Message is delivered to all subscribers, each must acknowledge.
ru: Сообщение доставляется всем подписчикам, каждый должен подтвердить.

source: **Fan-out without acknowledgment:**
ru: **Разветвление без подтверждения:**

source: Message is delivered to all without acknowledgment.
ru: Сообщение доставляется всем без подтверждения.

source: **Priority-based:**
ru: **В зависимости от приоритета:**

source: Messages are delivered by priority.
ru: Сообщения доставляются в приоритетном порядке.

source: Keep-alive Mechanism
ru: Механизм поддержания активности

source: PING/PONG mechanism is used to maintain active connections:
ru: Для поддержания активных соединений используется механизм PING/PONG:

source: If server doesn't receive PING within timeout, connection is closed.
ru: Если сервер не получает PING в течение таймаута, соединение закрывается.

source: Automatic Reconnections
ru: Автоматические переподключения

source: Client automatically reconnects on connection loss:
ru: Клиент автоматически переподключается при потере соединения:

source: Exponential backoff is used with 5 minute maximum.
ru: Экспоненциальная задержка используется максимум 5 минут.

source: Graceful Shutdown
ru: Плавное завершение работы

source: On server stop, graceful shutdown is performed:
ru: При остановке сервера выполняется корректное завершение работы:

source: Stop accepting new connections
ru: Перестаньте принимать новые связи

source: Send shutdown notification to clients
ru: Отправка уведомления об отключении клиентам

source: Wait for in-flight message processing (up to 30s)
ru: Ожидание обработки сообщения в полете (до 30 с)

source: Close all connections
ru: Закройте все соединения

source: Clean up resources
ru: Очистка ресурсов

source: Memory Management
ru: Управление памятью

source: Backpressure
ru: Противодавление

source: When memory usage reaches high level:
ru: Когда использование памяти достигает высокого уровня:

source: **Watermark 80%:** Backpressure enabled
ru: **Водяной знак 80 %:** Противодавление включено.

source: **Watermark 90%:** New publications blocked
ru: **Водяной знак 90 %:** Новые публикации заблокированы.

source: **Watermark 95%:** Overflow strategy applied
ru: **Водяной знак 95 %:** Применена стратегия переполнения.

source: Overflow strategies:
ru: Стратегии переполнения:

source: **DropOldest** — drop oldest message
ru: **DropOldest** — удалить самое старое сообщение.

source: **DropNewest** — reject new message
ru: **DropNewest** — отклонить новое сообщение

source: **BlockPublisher** — block publisher
ru: **BlockPublisher** — заблокировать издателя

source: **RedirectToDlq** — redirect to DLQ
ru: **RedirectToDlq** — перенаправление на DLQ

source: Object Pool
ru: Пул объектов

source: Message object pool is used to reduce allocations:
ru: Пул объектов сообщений используется для сокращения выделений:

source: Metrics and Monitoring
ru: Метрики и мониторинг

source: Collected metrics:
ru: Собранные метрики:

source: **Counters:**
ru: **Счетчики:**

source: ``TotalMessagesPublished`` — total published
ru: ``TotalMessagesPublished`` — всего опубликовано

source: ``TotalMessagesDelivered`` — total delivered
ru: ``TotalMessagesDelivered`` — общее количество доставленных

source: ``TotalMessagesAcknowledged`` — total acknowledged
ru: ``TotalMessagesAcknowledged`` — общее количество подтверждено

source: ``TotalRetries`` — total retries
ru: ``TotalRetries`` — общее количество повторов

source: ``TotalDeadLettered`` — total in DLQ
ru: ``TotalDeadLettered`` — итого в DLQ

source: ``TotalErrors`` — total errors
ru: ``TotalErrors`` — общее количество ошибок

source: ``TotalConnectionsAccepted`` — total connections
ru: ``TotalConnectionsAccepted`` — общее количество подключений

source: ``TotalConnectionsRejected`` — total rejections
ru: ``TotalConnectionsRejected`` — общее количество отказов

source: **Gauge metrics:**
ru: **Показатели датчика:**

source: ``ActiveConnections`` — active connections
ru: ``ActiveConnections`` — активные соединения

source: ``ActiveQueues`` — active queues
ru: ``ActiveQueues`` — активные очереди

source: ``InFlightMessages`` — in-flight messages
ru: ``InFlightMessages`` — сообщения в полете

source: ``MemoryUsageBytes`` — memory usage
ru: ``MemoryUsageBytes`` — использование памяти

source: **Latency:**
ru: **Задержка:**

source: ``AverageDeliveryLatencyMs`` — average delivery latency
ru: ``AverageDeliveryLatencyMs`` — средняя задержка доставки

source: Next Steps
ru: Следующие шаги

source: :doc:`features` — detailed feature overview
ru: :doc:`features` — подробный обзор функций

source: :doc:`protocol` — communication protocol details
ru: :doc:`protocol` — сведения о протоколе связи

source: :doc:`monitoring` — monitoring and metrics
ru: :doc:`monitoring` — мониторинг и метрики
