Repository: Bobsans/VibeMQ
Catalog: docs/locale/*/LC_MESSAGES/docs/client-usage.po
Languages: ru

source: Client Usage
ru: Использование клиента

source: This guide describes various ways to use the VibeMQ client.
ru: Это руководство описывает различные способы использования клиента VibeMQ.

source: Contents
ru: :local:

source: Connecting to Server
ru: :depth: 2

source: Basic Connection
ru: Подключение к серверу

source: Connection with Authentication
ru: Базовое подключение

source: Connection with Logging
ru: using VibeMQ.Client;

source: Publishing Messages
ru: await using var client = await VibeMQClient.ConnectAsync(

source: Basic Publishing
ru: "localhost",

source: Typed Publishing
ru: Console.WriteLine($"Подключено: {client.IsConnected}");

source: Create a class for the message:
ru: Создайте класс для сообщения:

source: Use it:
ru: Используйте его:

source: Subscribing to Messages
ru: "localhost",

source: Typed Subscription
ru: new ClientOptions {

source: Subscription with Error Handling
ru: AuthToken = "my-secret-token"

source: Automatic Unsubscribe
ru: Подключение с логированием

source: When using ``await using``, unsubscription happens automatically:
ru: При использовании ``await using`` отписка происходит автоматически:

source: Manual Unsubscribe
ru: using var loggerFactory = LoggerFactory.Create(builder => {

source: Or via client method:
ru: Или через метод клиента:

source: Creating a Queue
ru: var logger = loggerFactory.CreateLogger<VibeMQClient>();

source: Deleting a Queue
ru: var client = await VibeMQClient.ConnectAsync(

source: Getting Queue Information
ru: "localhost",

source: Client Settings
ru: new ClientOptions { AuthToken = "my-token" },

source: Configure reconnection policy:
ru: Настройка политики переподключения:

source: **How it works:**
ru: **Как работает:**

source: Attempt 1: immediately
ru: await client.PublishAsync("notifications", new {

source: Attempt 2: after 1s
ru: Title = "Привет",

source: Attempt 3: after 2s
ru: Body = "Это тестовое сообщение",

source: Attempt 4: after 4s
ru: Timestamp = DateTime.Now

source: Attempt N: after 5min (maximum)
ru: using VibeMQ.Core.Enums;

source: TLS/SSL Connection
ru: // Критическое сообщение

source: Connection with TLS:
ru: Подключение с TLS:

source: For production, use valid certificates. ``SkipCertificateValidation = true`` only for tests!
ru: Для production используйте валидные сертификаты.

source: Automatic Reconnection
ru: // Высокий приоритет

source: Client automatically reconnects on connection loss:
ru: Клиент автоматически переподключается при разрыве:

source: Status Check
ru: options.Priority = MessagePriority.High;

source: For status tracking, you can use periodic checks:
ru: Для отслеживания состояния можно использовать периодическую проверку:

source: Disconnecting
ru: await client.PublishAsync("orders", orderData, options => {

source: Graceful Disconnect
ru: options.Headers = new Dictionary<string, string> {

source: Using Using
ru: ["correlationId"] = Guid.NewGuid().ToString(),

source: Full resource release:
ru: ["source"] = "order-service",

source: Usage Examples
ru: ["version"] = "1.0"

source: Task Processing Worker
ru: Типизированная публикация

source: Event Bus for Microservices
ru: Создайте класс для сообщения:

source: Troubleshooting
ru: public class OrderCreated {

source: Connection Error
ru: public string OrderId { get; set; }

source: **Error:** ``Connection refused``
ru: public decimal Amount { get; set; }

source: **Causes:**
ru: public DateTime CreatedAt { get; set; }

source: Wrong port
ru: Используйте его:

source: Firewall blocking connection
ru: await client.PublishAsync("orders.created", new OrderCreated {

source: **Solution:**
ru: OrderId = "ORD-123",

source: Authentication Error
ru: Amount = 99.99m,

source: **Error:** ``Authentication failed``
ru: CreatedAt = DateTime.UtcNow

source: Connection Timeout
ru: Подписка на сообщения

source: **Error:** ``Connection timeout``
ru: Базовая подписка

source: **Solution:** Increase timeout:
ru: await using var subscription = await client.SubscribeAsync<dynamic>(

source: Frequent Disconnections
ru: "notifications",

source: **Cause:** Network or server issues
ru: async msg => {

source: **Solution:** Configure reconnect policy:
ru: Console.WriteLine($"Получено: {msg.Title} - {msg.Body}");

source: :doc:`configuration` — configuration parameters
ru: Типизированная подписка

source: :doc:`di-integration` — DI integration
ru: public class Notification {
