Repository: Bobsans/VibeMQ
Catalog: docs/locale/*/LC_MESSAGES/docs/configuration.po
Languages: ru

source: Configuration
ru: Конфигурация

source: This guide describes all configuration parameters for VibeMQ.
ru: Это руководство описывает все параметры конфигурации VibeMQ.

source: Contents
ru: :local:

source: Server Configuration
ru: :depth: 2

source: Main server configuration class:
ru: Основной класс конфигурации сервера:

source: Basic Parameters
ru: Основной класс конфигурации сервера:

source: **Type:** ``int``
ru: public int Port { get; set; } = 8080;

source: **Default:** ``8080``
ru: **По умолчанию:** ``8080``

source: TCP port for client connections:
ru: TCP порт для подключений клиентов:

source: Make sure the port is not occupied by other applications.
ru: Убедитесь, что порт не занят другими приложениями.

source: **Default:** ``1000``
ru: public QueueDefaults QueueDefaults { get; set; } = new();

source: Maximum number of simultaneous connections:
ru: Максимальное количество одновременных подключений:

source: Increase for high-load scenarios.
ru: Увеличьте для high-load сценариев.

source: **Default:** ``1_048_576`` (1 MB)
ru: **По умолчанию:** ``1_048_576`` (1 MB)

source: Maximum message size in bytes:
ru: Максимальный размер сообщения в байтах:

source: Large messages increase memory usage.
ru: Большие сообщения увеличивают использование памяти.

source: **Type:** ``bool``
ru: **По умолчанию:** ``8080``

source: **Default:** ``false``
ru: TCP порт для подключений клиентов:

source: Enable authentication:
ru: Включить аутентификацию:

source: **Type:** ``string?``
ru: MaxConnections

source: Token for client authentication:
ru: Токен для аутентификации клиентов:

source: Use complex tokens (32+ characters) in production.
ru: Используйте сложные токены (32+ символа) в production.

source: Default queue settings:
ru: Настройки очередей по умолчанию:

source: **Type:** ``DeliveryMode``
ru: **Тип:** ``DeliveryMode``

source: **Default:** ``RoundRobin``
ru: **По умолчанию:** ``RoundRobin``

source: Default delivery mode:
ru: Режим доставки по умолчанию:

source: **Possible values:**
ru: **По умолчанию:** ``1_048_576`` (1 MB)

source: ``RoundRobin`` — round-robin delivery to one subscriber
ru: Максимальный размер сообщения в байтах:

source: ``FanOutWithAck`` — to all with acknowledgment
ru: .UseMaxMessageSize(2_097_152) // 2 MB

source: ``FanOutWithoutAck`` — to all without acknowledgment
ru: Большие сообщения увеличивают использование памяти.

source: ``PriorityBased`` — by priority
ru: EnableAuthentication

source: **Default:** ``10_000``
ru: **По умолчанию:** ``10_000``

source: Maximum number of messages in queue:
ru: Максимальное количество сообщений в очереди:

source: **Default:** ``true``
ru: .UseAuthentication("my-secret-token")

source: Automatically create queues on first publish:
ru: Автоматическое создание очередей при первой публикации:

source: Disable for strict queue control.
ru: Отключите для строгого контроля очередей.

source: **Type:** ``TimeSpan?``
ru: **Тип:** ``TimeSpan?``

source: **Default:** ``null`` (no limit)
ru: **По умолчанию:** ``null`` (без ограничения)

source: Message time-to-live:
ru: Время жизни сообщений:

source: Expired messages are automatically removed.
ru: Истёкшие сообщения автоматически удаляются.

source: Enable Dead Letter Queue:
ru: Включить Dead Letter Queue:

source: **Default:** ``null`` (auto-name)
ru: **По умолчанию:** ``null`` (автоимя)

source: Dead Letter Queue name:
ru: Имя Dead Letter Queue:

source: **Type:** ``OverflowStrategy``
ru: **Тип:** ``OverflowStrategy``

source: **Default:** ``DropOldest``
ru: **По умолчанию:** ``DropOldest``

source: Queue overflow strategy:
ru: Стратегия переполнения очереди:

source: ``DropOldest`` — remove oldest message
ru: public OverflowStrategy OverflowStrategy { get; set; } = OverflowStrategy.DropOldest;

source: ``DropNewest`` — reject new message
ru: public int MaxRetryAttempts { get; set; } = 3;

source: ``RedirectToDlq`` — redirect to DLQ
ru: DefaultDeliveryMode

source: **Default:** ``3``
ru: **По умолчанию:** ``3``

source: Maximum number of delivery attempts:
ru: Максимальное количество попыток доставки:

source: TLS/SSL settings:
ru: Настройки TLS/SSL:

source: Enable TLS:
ru: Включить TLS:

source: Path to PFX certificate:
ru: Путь к PFX-сертификату:

source: Certificate password:
ru: Пароль к сертификату:

source: Rate limiting settings:
ru: Настройки rate limiting:

source: Enable rate limiting:
ru: Включить rate limiting:

source: **Default:** ``100``
ru: **По умолчанию:** ``100``

source: Maximum number of connections from one IP per time window:
ru: Максимальное количество подключений с одного IP в окно времени:

source: **Default:** ``60``
ru: **По умолчанию:** ``60``

source: Time window for connection limiting (seconds):
ru: Окно времени для ограничения подключений (секунды):

source: Maximum number of messages from client per second:
ru: Максимальное количество сообщений от клиента в секунду:

source: Client Configuration
ru: **По умолчанию:** ``null`` (без ограничения)

source: Token for authentication:
ru: Токен для аутентификации:

source: **Type:** ``ReconnectPolicy``
ru: **Тип:** ``ReconnectPolicy``

source: Reconnection policy:
ru: Политика переподключения:

source: **Type:** ``TimeSpan``
ru: **По умолчанию:** ``false``

source: **Default:** ``30 seconds``
ru: **По умолчанию:** ``30 секунд``

source: PING send interval:
ru: Интервал отправки PING:

source: **Default:** ``10 seconds``
ru: **По умолчанию:** ``10 секунд``

source: Command timeout:
ru: Таймаут для команд:

source: Use TLS:
ru: Использовать TLS:

source: Skip certificate validation:
ru: Пропускать валидацию сертификата:

source: Do not use in production!
ru: Не используйте в production!

source: **Default:** ``int.MaxValue``
ru: **По умолчанию:** ``int.MaxValue``

source: Maximum number of attempts:
ru: Максимальное количество попыток:

source: **Default:** ``1 second``
ru: **По умолчанию:** ``1 секунда``

source: Initial delay between attempts:
ru: Начальная задержка между попытками:

source: **Default:** ``5 minutes``
ru: **По умолчанию:** ``5 минут``

source: Maximum delay:
ru: Максимальная задержка:

source: Use exponential backoff:
ru: Использовать экспоненциальное увеличение задержки:

source: Health Check Configuration
ru: TlsOptions

source: Enable health check server:
ru: Включить health check сервер:

source: **Default:** ``8081``
ru: **По умолчанию:** ``8081``

source: HTTP port for health checks:
ru: HTTP порт для health checks:

source: Configuration Examples
ru: public string? CertificatePassword { get; set; }

source: Development
ru: Enabled

source: IoT Scenario
ru: **Тип:** ``bool``

source: Microservices
ru: **По умолчанию:** ``false``

source: Next Steps
ru: Включить TLS:

source: :doc:`server-setup` — server setup
ru: .UseTls(options => {

source: :doc:`di-integration` — DI integration
ru: options.Enabled = true;

source: :doc:`monitoring` — monitoring
ru: options.CertificatePath = "/path/to/cert.pfx";
