Repository: Bobsans/VibeMQ
Catalog: docs/locale/*/LC_MESSAGES/docs/di-integration.po
Languages: ru

source: DI Integration
ru: Интеграция с DI

source: This guide describes VibeMQ integration with Microsoft.Extensions.DependencyInjection.
ru: Это руководство описывает интеграцию VibeMQ с Microsoft.Extensions.DependencyInjection.

source: Contents
ru: Содержание

source: Overview
ru: Обзор

source: VibeMQ provides packages for convenient Dependency Injection integration:
ru: VibeMQ предоставляет пакеты для удобной интеграции с Dependency Injection:

source: ``VibeMQ.Server.DependencyInjection`` — for server
ru: ``VibeMQ.Server.DependencyInjection`` — для сервера

source: ``VibeMQ.Client.DependencyInjection`` — for client
ru: ``VibeMQ.Client.DependencyInjection`` — для клиента

source: These packages register necessary services in the DI container and automatically manage component lifecycle.
ru: Эти пакеты регистрируют необходимые сервисы в DI-контейнере и автоматически управляют жизненным циклом компонентов.

source: Package Installation
ru: Установка пакетов

source: Server Integration
ru: Интеграция сервера

source: Basic Registration
ru: Базовая регистрация

source: The server will start automatically when the host starts.
ru: Сервер запускается автоматически при старте хоста.

source: Registration with Configuration
ru: Регистрация с конфигурацией

source: Configuration from appsettings.json
ru: Конфигурация из appsettings.json

source: Advanced Configuration
ru: Расширенная конфигурация

source: Client Integration
ru: Интеграция клиента

source: A single call to ``AddVibeMQClient`` registers:
ru: Один вызов ``AddVibeMQClient`` регистрирует:

source: **``IVibeMQClient``** — a shared, lazily-connected client (Singleton). Inject it into any service and use ``PublishAsync`` / ``SubscribeAsync``; the connection is established on first use. No need to call ``ConnectAsync`` or dispose the client yourself; the host manages its lifecycle.
ru: **``IVibeMQClient``** — общий клиент с ленивым подключением (Singleton). Внедрите его в любой сервис и используйте ``PublishAsync`` / ``SubscribeAsync``; подключение устанавливается при первом обращении. Не нужно вызывать ``ConnectAsync`` или освобождать клиент — жизненным циклом управляет хост.

source: **``IVibeMQClientFactory``** — use when you need a dedicated client instance that you create and dispose yourself (e.g. ``await using var client = await factory.CreateAsync()``).
ru: **``IVibeMQClientFactory``** — используйте, когда нужен отдельный экземпляр клиента, который вы создаёте и освобождаете сами (например, ``await using var client = await factory.CreateAsync()``).

source: Advanced Client Configuration
ru: Расширенная конфигурация клиента

source: Using in Services
ru: Использование в сервисах

source: Publishing Messages from Service (IVibeMQClient)
ru: Публикация сообщений из сервиса (IVibeMQClient)

source: The simplest approach is to inject ``IVibeMQClient``. The client connects lazily on first use; no manual ``ConnectAsync`` or disposal in your service.
ru: Проще всего внедрить ``IVibeMQClient``. Клиент подключается лениво при первом обращении; не нужно вручную вызывать ``ConnectAsync`` или освобождать клиент в сервисе.

source: Service registration:
ru: Регистрация сервиса:

source: Publishing with IVibeMQClientFactory (dedicated client)
ru: Публикация через IVibeMQClientFactory (выделенный клиент)

source: If you prefer a dedicated client instance per operation (you create and dispose it):
ru: Если нужен отдельный экземпляр клиента на операцию (создаёте и освобождаете его сами):

source: Subscribing to Messages in Background Service
ru: Подписка на сообщения в фоновом сервисе

source: You can use either ``IVibeMQClient`` (shared, lazy-connected) or ``IVibeMQClientFactory``. Example with ``IVibeMQClient``:
ru: Можно использовать ``IVibeMQClient`` (общий, ленивое подключение) или ``IVibeMQClientFactory``. Пример с ``IVibeMQClient``:

source: Background service registration:
ru: Регистрация фонового сервиса:

source: Event Bus with DI
ru: Шина событий с DI

source: A thin event-bus wrapper around ``IVibeMQClient`` (shared client, lazy connection):
ru: Тонкая обёртка шины событий вокруг ``IVibeMQClient`` (общий клиент, ленивое подключение):

source: Registration:
ru: Регистрация:

source: Usage:
ru: Использование:

source: Combined Usage
ru: Совместное использование

source: Server + Client in One Application
ru: Сервер и клиент в одном приложении

source: Multiple brokers
ru: Несколько брокеров

source: To use multiple brokers, register multiple named configurations and resolve the appropriate factory or client by name (e.g. via a custom factory or keyed services if your app supports them). By default, one ``AddVibeMQClient`` call registers a single shared ``IVibeMQClient`` and one ``IVibeMQClientFactory`` for that configuration.
ru: Для работы с несколькими брокерами зарегистрируйте несколько именованных конфигураций и разрешайте нужную фабрику или клиент по имени (например, через кастомную фабрику или keyed-сервисы, если приложение это поддерживает). По умолчанию один вызов ``AddVibeMQClient`` регистрирует один общий ``IVibeMQClient`` и одну ``IVibeMQClientFactory`` для этой конфигурации.
