Repository: Bobsans/VibeMQ
Catalog: docs/locale/*/LC_MESSAGES/docs/installation.po
Languages: ru

source: Installation
ru: Установка

source: This guide describes various ways to install VibeMQ.
ru: Это руководство описывает различные способы установки VibeMQ.

source: Contents
ru: :local:

source: System Requirements
ru: :depth: 2

source: **Minimum requirements:**
ru: **Минимальные требования:**

source: OS: Windows, Linux, macOS
ru: **Минимальные требования:**

source: .NET 8.0 SDK or higher
ru: **Для production:**

source: RAM: 512 MB (1 GB+ recommended)
ru: Установка через NuGet

source: Disk space: 100 MB
ru: Базовые пакеты

source: **For production:**
ru: **Для production:**

source: .NET 8.0 Runtime or .NET 10.0
ru: dotnet add package VibeMQ.Server

source: 2+ GB RAM
ru: dotnet add package VibeMQ.Client

source: SSD for better performance
ru: dotnet add package VibeMQ.Core

source: NuGet Installation
ru: dotnet add package VibeMQ.Protocol

source: Basic Packages
ru: dotnet add package VibeMQ.Health

source: To use VibeMQ in your project, add the required packages:
ru: Для использования VibeMQ в вашем проекте добавьте необходимые пакеты:

source: Dependency Injection Packages
ru: Для интеграции с Microsoft.Extensions.DependencyInjection:

source: For integration with Microsoft.Extensions.DependencyInjection:
ru: Для интеграции с Microsoft.Extensions.DependencyInjection:

source: All Packages at Once
ru: dotnet add package VibeMQ.Client.DependencyInjection

source: For quick addition of all components:
ru: Для быстрого добавления всех компонентов:

source: Docker Installation
ru: Для быстрого добавления всех компонентов:

source: VibeMQ can be run in a Docker container.
ru: VibeMQ можно запустить в Docker-контейнере.

source: Create a ``Dockerfile`` in your project:
ru: Создайте ``Dockerfile`` в вашем проекте:

source: Build and run:
ru: Сборка и запуск:

source: For deployment with other services, create a ``docker-compose.yml``:
ru: Для развёртывания с другими сервисами создайте ``docker-compose.yml``:

source: Start:
ru: Запуск:

source: Installation from Source Code
ru: Dockerfile

source: Clone the Repository
ru: Создайте ``Dockerfile`` в вашем проекте:

source: Build the Project
ru: FROM mcr.microsoft.com/dotnet/runtime:8.0 AS base

source: Local Package Installation
ru: WORKDIR /app

source: To use a locally built version:
ru: Для использования локально собранной версии:

source: Integration into Existing Projects
ru: FROM mcr.microsoft.com/dotnet/sdk:8.0 AS build

source: ASP.NET Core Application
ru: WORKDIR /src

source: For ASP.NET Core applications, use DI integration:
ru: Для ASP.NET Core приложений используйте DI-интеграцию:

source: For background services (.NET Worker):
ru: Для фоновых сервисов (.NET Worker):

source: Console Application
ru: RUN dotnet build -c Release -o /app/build

source: For console applications, use direct invocation:
ru: Для консольных приложений используйте прямой вызов:

source: Installation Verification
ru: RUN dotnet publish -c Release -o /app/publish

source: Server Verification
ru: FROM base AS final

source: After starting the server, check the health endpoint:
ru: После запуска сервера проверьте health check:

source: Response should be:
ru: Ответ должен быть:

source: Client Verification
ru: ENTRYPOINT ["dotnet", "VibeMQ.Server.dll"]

source: Create a test script:
ru: Создайте тестовый скрипт:

source: Troubleshooting
ru: docker build -t vibemq-server .

source: Port Already in Use
ru: docker run -p 8080:8080 -p 8081:8081 vibemq-server

source: **Error:** ``Address already in use``
ru: **Ошибка:** ``Address already in use``

source: **Solution:** Change the port in configuration:
ru: **Решение:** Измените порт в конфигурации:

source: Authentication Error
ru: version: '3.8'

source: **Error:** ``Authentication failed``
ru: **Ошибка:** ``Authentication failed``

source: **Solution:** Make sure tokens match:
ru: **Решение:** Убедитесь, что токены совпадают:

source: TLS/SSL Errors
ru: image: vibemq-server:latest

source: **Error:** ``The remote certificate is invalid``
ru: **Ошибка:** ``The remote certificate is invalid``

source: **Solution:** For tests, disable validation:
ru: **Решение:** Для тестов отключите валидацию:

source: For production, use valid certificates.
ru: Для production используйте валидные сертификаты.

source: Next Steps
ru: volumes:

source: :doc:`getting-started` — quick start guide
ru: restart: unless-stopped

source: :doc:`server-setup` — server configuration
ru: my-app:

source: :doc:`configuration` — configuration parameters
ru: image: my-app:latest
