Repository: Bobsans/VibeMQ
Catalog: docs/locale/*/LC_MESSAGES/docs/protocol.po
Languages: ru

source: Communication Protocol
ru: Протокол связи

source: This guide describes the VibeMQ message exchange protocol.
ru: Это руководство описывает протокол обмена сообщениями VibeMQ.

source: Contents
ru: :local:

source: Overview
ru: :depth: 2

source: VibeMQ uses TCP as transport and JSON for message serialization. The protocol is designed for simplicity and performance.
ru: VibeMQ использует TCP в качестве транспорта и JSON для сериализации сообщений. Протокол разработан для простоты и производительности.

source: Protocol Layers
ru: VibeMQ использует TCP в качестве транспорта и JSON для сериализации сообщений. Протокол разработан для простоты и производительности.

source: Framing
ru: Уровни протокола

source: **Length-prefix** approach is used to separate messages in TCP stream:
ru: Для разделения сообщений в TCP-потоке используется **length-prefix** подход:

source: Length Format
ru: │ Прикладной уровень (JSON) │

source: First 4 bytes of each frame contain message body length encoded as Big Endian:
ru: Первые 4 байта каждого фрейма содержат длину тела сообщения в кодировке Big Endian:

source: Frame Example
ru: │ Фрейминг (Length-prefix) │

source: Basic Structure
ru: │ Транспорт (TCP) │

source: All protocol messages have common structure:
ru: Все сообщения протокола имеют общую структуру:

source: Message Fields
ru: Фрейминг

source: Command Types (CommandType)
ru: Для разделения сообщений в TCP-потоке используется **length-prefix** подход:

source: Command Descriptions
ru: [4 байта: длина тела в Big Endian uint32] [N байт: JSON-тело в UTF-8]

source: Connection Management
ru: Формат длины

source: **Direction:** Client → Server
ru: // Чтение длины

source: **Description:** Connection request.
ru: **Описание:** Запрос на установление соединения.

source: **Direction:** Server → Client
ru: // Запись длины

source: **Description:** Connection acknowledgment.
ru: **Описание:** Подтверждение соединения.

source: **Description:** Disconnection request.
ru: **Описание:** Запрос на завершение соединения.

source: **Description:** Connection keep-alive check.
ru: **Описание:** Проверка активности соединения.

source: **Description:** Response to Ping.
ru: **Описание:** Ответ на Ping.

source: Publish/Subscribe
ru: Все сообщения протокола имеют общую структуру:

source: **Description:** Publish message to queue.
ru: **Описание:** Публикация сообщения в очередь.

source: **Description:** Publish acknowledgment.
ru: **Описание:** Подтверждение публикации.

source: **Description:** Subscribe to queue.
ru: **Описание:** Подписка на очередь.

source: **Description:** Subscription acknowledgment.
ru: **Описание:** Подтверждение подписки.

source: **Description:** Unsubscribe from queue.
ru: **Описание:** Отписка от очереди.

source: **Description:** Unsubscription acknowledgment.
ru: **Описание:** Подтверждение отписки.

source: **Description:** Message delivery to subscriber.
ru: **Описание:** Доставка сообщения подписчику.

source: Acknowledgment
ru: | ``headers`` | object? | Заголовки │

source: **Description:** Message receipt acknowledgment.
ru: **Описание:** Подтверждение получения сообщения.

source: Queue Management
ru: | ``errorCode`` | string? | Код ошибки (для Error) │

source: **Description:** Create queue.
ru: **Описание:** Создание очереди.

source: **Description:** Delete queue.
ru: **Описание:** Удаление очереди.

source: **Direction:** Client → Server, Server → Client
ru: ConnectAck = 1,

source: **Description:** Queue information request/response.
ru: **Описание:** Запрос/ответ информации об очереди.

source: **Request:**
ru: // Keep-alive

source: **Response:**
ru: Ping = 10,

source: **Description:** Queue list request/response.
ru: **Описание:** Запрос/ответ списка очередей.

source: Errors
ru: Publish = 20,

source: **Description:** Error message.
ru: **Описание:** Сообщение об ошибке.

source: Error Codes
ru: SubscribeAck = 23,

source: Headers
ru: Unsubscribe = 24,

source: Common Headers
ru: UnsubscribeAck = 25,

source: Message Headers
ru: Deliver = 26,

source: Queue Headers
ru: // Подтверждение

source: Exchange Examples
ru: Ack = 30,

source: Connection Establishment
ru: // Управление очередями

source: Message Publishing
ru: CreateQueue = 40,

source: Message Delivery
ru: DeleteQueue = 41,

source: Protocol Versions
ru: QueueInfo = 42,

source: Current version: **1.0**
ru: Текущая версия: **1.0**

source: Next Steps
ru: // Ошибки

source: :doc:`architecture` — system architecture
ru: Error = 99,

source: :doc:`monitoring` — monitoring
ru: Описание команд
