Repository: Bobsans/VibeMQ
Catalog: docs/locale/*/LC_MESSAGES/examples.po
Languages: ru

source: Examples
ru: Примеры

source: This guide contains practical examples of using VibeMQ.
ru: Это руководство содержит практические примеры использования VibeMQ.

source: Contents
ru: :local:

source: Basic Examples
ru: :depth: 2

source: Simple Publisher
ru: Базовые примеры

source: Simple Subscriber
ru: Простой издатель

source: Server
ru: using Microsoft.Extensions.Logging;

source: Task Queues
ru: using VibeMQ.Client;

source: Order Processing
ru: using var loggerFactory = LoggerFactory.Create(builder => {

source: **Publisher (OrderService.cs):**
ru: **Издатель (OrderService.cs):**

source: **Handler (OrderProcessor.cs):**
ru: **Обработчик (OrderProcessor.cs):**

source: **DI Registration:**
ru: **Регистрация в DI:**

source: Background Tasks with Priorities
ru: await using var publisher = await VibeMQClient.ConnectAsync(

source: **Usage:**
ru: "localhost",

source: EventBus Implementation
ru: new ClientOptions { AuthToken = "my-token" },

source: **Registration:**
ru: **Регистрация:**

source: Data Synchronization Between Services
ru: Console.WriteLine("Издатель подключён. Введите сообщение (Enter для выхода):");

source: **User Service (Users.cs):**
ru: **Сервис пользователей (Users.cs):**

source: **Notification Service (Notifications.cs):**
ru: **Сервис уведомлений (Notifications.cs):**

source: **Analytics Service (Analytics.cs):**
ru: **Сервис аналитики (Analytics.cs):**

source: CQRS with VibeMQ
ru: await publisher.PublishAsync("messages", new {

source: Custom Logger
ru: Console.WriteLine("✓ Сообщение отправлено");

source: Next Steps
ru: Простой подписчик

source: :doc:`getting-started` — quick start
ru: using Microsoft.Extensions.Logging;

source: :doc:`client-usage` — client usage
ru: using VibeMQ.Client;

source: :doc:`di-integration` — DI integration
ru: using var loggerFactory = LoggerFactory.Create(builder => {
