Repository: Bobsans/VibeMQ
Catalog: docs/locale/*/LC_MESSAGES/faq.po
Languages: ru

source: Frequently Asked Questions
ru: Часто задаваемые вопросы

source: This guide answers common questions about VibeMQ.
ru: Это руководство отвечает на распространённые вопросы о VibeMQ.

source: Contents
ru: :local:

source: General Questions
ru: :depth: 2

source: What is VibeMQ?
ru: Общие вопросы

source: **VibeMQ** is a simple but reliable message broker for .NET applications. It supports:
ru: **VibeMQ** — это простой, но надёжный месседж-брокер для .NET приложений. Он поддерживает:

source: Publish/subscribe (pub/sub)
ru: **VibeMQ** — это простой, но надёжный месседж-брокер для .NET приложений. Он поддерживает:

source: Queues with delivery guarantees
ru: Чем VibeMQ отличается от RabbitMQ/Kafka?

source: Automatic reconnections
ru: **VibeMQ vs RabbitMQ:**

source: Token-based authentication
ru: **VibeMQ vs Kafka:**

source: TLS/SSL encryption
ru: Когда использовать VibeMQ?

source: Health checks for orchestrators
ru: **Хорошие сценарии:**

source: How is VibeMQ different from RabbitMQ/Kafka?
ru: **Не подходит для:**

source: VibeMQ is simpler to configure and use
ru: Технические вопросы

source: Does not require external dependencies (databases, etc.)
ru: Как работает гарантия доставки?

source: Written in C# for .NET ecosystem
ru: VibeMQ использует механизм подтверждений (ACK):

source: Less functionality, but sufficient for most scenarios
ru: 1. Брокер отправляет сообщение подписчику

source: VibeMQ is not a distributed event log
ru: 3. Подписчик обрабатывает сообщение и отправляет ACK

source: Does not support persistent storage (in current version)
ru: 4. Если ACK не получен — повторная отправка

source: Simpler to deploy and use
ru: 5. После исчерпания попыток — Dead Letter Queue

source: Better suited for task queues and real-time notifications
ru: Что происходит при перезапуске сервера?

source: When to use VibeMQ?
ru: **Текущая версия:**

source: **Good scenarios:**
ru: **Хорошие сценарии:**

source: Task queues for background processing
ru: Как масштабировать VibeMQ?

source: Notifications between microservices
ru: **Горизонтальное масштабирование:**

source: Real-time updates
ru: 1. Запустите несколько экземпляров сервера

source: Event-driven architecture
ru: 2. Используйте балансировщик нагрузки

source: Distributed systems on .NET
ru: 3. Клиенты подключаются к ближайшему серверу

source: **Not suitable for:**
ru: **Не подходит для:**

source: Storing large volumes of data
ru: **Планируется:**

source: Real-time streaming (use Kafka)
ru: Как обеспечить безопасность?

source: Complex message routing (use RabbitMQ)
ru: **Аутентификация:**

source: Transactional messages
ru: .UseAuthentication("my-secret-token")

source: What .NET versions are supported?
ru: **TLS шифрование:**

source: **.NET 8.0** (main target platform)
ru: .UseTls(options => {

source: **.NET 10.0** (support planned)
ru: options.Enabled = true;

source: Technical Questions
ru: options.CertificatePath = "/path/to/cert.pfx";

source: VibeMQ uses acknowledgment (ACK) mechanism:
ru: VibeMQ использует механизм подтверждений (ACK):

source: Broker sends message to subscriber
ru: 1. Брокер отправляет сообщение подписчику

source: ACK wait timer starts
ru: 2. Запускается таймер ожидания ACK

source: Subscriber processes message and sends ACK
ru: 3. Подписчик обрабатывает сообщение и отправляет ACK

source: If ACK not received — retry delivery
ru: 4. Если ACK не получен — повторная отправка

source: After exhausting attempts — Dead Letter Queue
ru: 5. После исчерпания попыток — Dead Letter Queue

source: What happens when server restarts?
ru: Как работает Dead Letter Queue?

source: **Current version:**
ru: **Текущая версия:**

source: Messages in queues are lost (in-memory storage)
ru: .ConfigureQueues(options => {

source: Connections must be restored
ru: options.EnableDeadLetterQueue = true;

source: **Planned:**
ru: options.MaxRetryAttempts = 3;

source: State recovery after restart
ru: **Причины попадания в DLQ:**

source: How to scale VibeMQ?
ru: Развёртывание

source: **Horizontal scaling:**
ru: **Горизонтальное масштабирование:**

source: Run multiple server instances
ru: 1. Запустите несколько экземпляров сервера

source: Use load balancer
ru: 2. Используйте балансировщик нагрузки

source: Clients connect to nearest server
ru: 3. Клиенты подключаются к ближайшему серверу

source: **Vertical scaling:**
ru: **Вертикальное масштабирование:**

source: Increase limits (MaxConnections, MaxQueueSize)
ru: COPY . .

source: Add resources (CPU, RAM)
ru: ENTRYPOINT ["dotnet", "VibeMQ.Server.dll"]

source: Clustering for automatic scaling
ru: **Запуск:**

source: How to ensure security?
ru: docker build -t vibemq-server .

source: **Authentication:**
ru: **Аутентификация:**

source: **TLS encryption:**
ru: **TLS шифрование:**

source: What delivery modes are supported?
ru: apiVersion: apps/v1

source: **Round-robin** — to each subscriber in turn
ru: kind: Deployment

source: **Fan-out with ACK** — to all with acknowledgment
ru: metadata:

source: **Fan-out without ACK** — to all without acknowledgment
ru: name: vibemq

source: **Priority-based** — by priority
ru: spec:

source: How does Dead Letter Queue work?
ru: replicas: 3

source: DLQ stores messages that could not be delivered:
ru: DLQ хранит сообщения, которые не удалось доставить:

source: **Reasons for DLQ:**
ru: **Причины попадания в DLQ:**

source: Exceeded delivery attempt count
ru: app: vibemq

source: Message TTL expired
ru: template:

source: Deserialization error
ru: spec:

source: Exception in handler
ru: containers:

source: Deployment
ru: image: vibemq-server:latest

source: How to run in Docker?
ru: ports:

source: **Run:**
ru: **Запуск:**

source: How to use with Kubernetes?
ru: path: /health/

source: How to configure for production?
ru: initialDelaySeconds: 10

source: **Recommendations:**
ru: periodSeconds: 10

source: Performance
ru: Как настроить для production?

source: What is VibeMQ performance?
ru: **Рекомендации:**

source: **Benchmarks:**
ru: **Бенчмарки:**

source: 10,000+ messages/sec on single node
ru: .UsePort(8080)

source: Latency < 10ms for 95% of messages
ru: .UseAuthentication(Environment.GetEnvironmentVariable("VIBEMQ_TOKEN"))

source: Support for 1000+ simultaneous connections
ru: .UseMaxConnections(5000)

source: **Factors affecting performance:**
ru: **Факторы, влияющие на производительность:**

source: Message size
ru: options.DefaultDeliveryMode = DeliveryMode.FanOutWithAck;

source: Number of subscribers
ru: options.MaxQueueSize = 100_000;

source: Delivery mode
ru: options.EnableDeadLetterQueue = true;

source: Network latency
ru: options.MaxRetryAttempts = 5;

source: **On server:**
ru: **На сервере:**

source: **On client:**
ru: **На клиенте:**

source: **General recommendations:**
ru: **Общие рекомендации:**

source: Use batching for publishing
ru: options.MaxMessagesPerClientPerSecond = 5000;

source: Monitor performance metrics
ru: .UseTls(options => {

source: Security
ru: options.Enabled = true;

source: How secure is token authentication?
ru: options.CertificatePath = "/etc/ssl/vibemq.pfx";

source: Store tokens in secure location (Key Vault, Secrets Manager)
ru: .ConfigureHealthChecks(options => {

source: Rotate tokens periodically
ru: options.Enabled = true;

source: Use different tokens for different environments
ru: options.Port = 8081;

source: Token authentication is suitable for internal security. For public APIs use OAuth2/OIDC.
ru: Токен-аутентификация подходит для внутренней безопасности.

source: Do I need to use TLS?
ru: .Build();

source: **Yes, if:**
ru: **Да, если:**

source: Messages contain sensitive data
ru: Какая производительность VibeMQ?

source: Network is untrusted
ru: **Бенчмарки:**

source: Security compliance required
ru: **Факторы, влияющие на производительность:**

source: **No, if:**
ru: **Нет, если:**

source: All services in trusted network
ru: **На сервере:**

source: TLS terminates at load balancer level
ru: .UseMaxConnections(5000) // Увеличьте лимит

source: How to protect against DDoS?
ru: .ConfigureQueues(options => {

source: **Additionally:**
ru: **Дополнительно:**

source: Use firewall
ru: options.OverflowStrategy = OverflowStrategy.DropOldest; // Быстрая стратегия

source: Monitor anomalies
ru: **На клиенте:**

source: Integration
ru: new ClientOptions {

source: How to use with ASP.NET Core?
ru: KeepAliveInterval = TimeSpan.FromSeconds(60), // Реже PING

source: How to use with Worker Service?
ru: CommandTimeout = TimeSpan.FromSeconds(5) // Меньше таймаут

source: **Current version:** Only .NET clients
ru: **Текущая версия:** Только .NET клиенты

source: Clients for Java, Python, Node.js
ru: Безопасность

source: AMQP/MQTT protocol support
ru: Насколько безопасна аутентификация по токену?

source: Troubleshooting
ru: **Рекомендации:**

source: Why are messages lost?
ru: Токен-аутентификация подходит для внутренней безопасности.

source: **Causes:**
ru: Для публичных API используйте OAuth2/OIDC.

source: Server restarted (in-memory storage)
ru: Нужно ли использовать TLS?

source: Queue size exceeded
ru: **Да, если:**

source: **Solution:**
ru: **Нет, если:**

source: Why high latency?
ru: Как защитить от DDoS?

source: Server overload
ru: **Rate limiting:**

source: Slow handlers
ru: .ConfigureRateLimiting(options => {

source: Network issues
ru: options.Enabled = true;

source: Optimize handlers
ru: options.MaxConnectionsPerIpPerWindow = 50;

source: Increase server resources
ru: options.MaxMessagesPerClientPerSecond = 100;

source: Why frequent disconnections?
ru: **Дополнительно:**

source: Keep-alive timeout
ru: Интеграция

source: Server restarting
ru: Как использовать с ASP.NET Core?

source: Next Steps
ru: using VibeMQ.Server.DependencyInjection;

source: :doc:`getting-started` — quick start
ru: using VibeMQ.Client.DependencyInjection;

source: :doc:`troubleshooting` — troubleshooting
ru: var builder = WebApplication.CreateBuilder(args);

source: :doc:`examples` — usage examples
ru: // Сервер
