Repository: Bobsans/VibeMQ
Catalog: docs/locale/*/LC_MESSAGES/features.po
Languages: ru

source: Features
ru: Возможности

source: This guide describes all capabilities and features of VibeMQ.
ru: Это руководство описывает все возможности и функции VibeMQ.

source: Contents
ru: :local:

source: Publish/Subscribe (Pub/Sub)
ru: :depth: 2

source: VibeMQ implements the publish/subscribe pattern through message queues.
ru: VibeMQ реализует паттерн публикации/подписки через очереди сообщений.

source: **Basic concepts:**
ru: **Основные понятия:**

source: **Publisher** — client sending messages
ru: **Основные понятия:**

source: **Subscriber** — client receiving messages
ru: **Базовый пример:**

source: **Queue** — buffer for storing messages
ru: // Издатель

source: **Broker** — server managing queues
ru: await client.PublishAsync("notifications", new {

source: **Basic example:**
ru: **Базовый пример:**

source: Delivery Modes
ru: Body = "World"

source: VibeMQ supports four message delivery modes:
ru: VibeMQ поддерживает четыре режима доставки сообщений:

source: **Description:** Each message is delivered to one subscriber cyclically.
ru: **Описание:** Каждое сообщение доставляется одному подписчику циклически.

source: **Configuration:**
ru: "notifications",

source: **Use cases:**
ru: async msg => {

source: Task processing by multiple workers
ru: Console.WriteLine($"{msg.Title}: {msg.Body}");

source: Fan-out with Acknowledgment
ru: Режимы доставки

source: **Description:** Message is delivered to all subscribers, each must acknowledge receipt.
ru: **Описание:** Сообщение доставляется всем подписчикам, каждый должен подтвердить получение.

source: Notification broadcasting
ru: Round-robin

source: Data replication
ru: **Описание:** Каждое сообщение доставляется одному подписчику циклически.

source: Audit and logging
ru: Publisher → [Queue] → Subscriber 1 (сообщение 1)

source: Fan-out without Acknowledgment
ru: → Subscriber 2 (сообщение 2)

source: **Description:** Message is delivered to all subscribers without confirmation.
ru: **Описание:** Сообщение доставляется всем подписчикам без подтверждения.

source: Broadcast messages
ru: **Настройка:**

source: Real-time updates
ru: options.DefaultDeliveryMode = DeliveryMode.RoundRobin;

source: Data streaming
ru: **Использование:**

source: **Description:** Messages are delivered by priority.
ru: **Описание:** Сообщения доставляются по приоритету.

source: **Priorities:**
ru: **Приоритеты:**

source: Priority
ru: | Приоритет | Значе-| Описание |

source: Value
ru: | Приоритет | Значе-| Описание |

source: Description
ru: **Настройка:**

source: Critical
ru: options.DefaultDeliveryMode = DeliveryMode.FanOutWithAck;

source: Critical, delivered first
ru: **Использование:**

source: High
ru: Fan-out без подтверждения

source: High priority
ru: Publisher → [Queue] → Subscriber 1 (копия)

source: Normal
ru: → Subscriber 2 (копия)

source: Normal (default)
ru: **Настройка:**

source: Low
ru: options.DefaultDeliveryMode = DeliveryMode.FanOutWithoutAck;

source: Low, delivered last
ru: Priority-based

source: **Publish with priority:**
ru: **Описание:** Сообщения доставляются по приоритету.

source: Delivery Guarantees
ru: [Critical] → [High] → [Normal] → [Low]

source: Acknowledgments (ACK)
ru: **Приоритеты:**

source: VibeMQ uses an acknowledgment mechanism for delivery guarantees:
ru: | Приоритет | Значе-| Описание |

source: **How it works:**
ru: | | ние | |

source: Broker sends message to client
ru: | Critical | 3 | Критические, доставляются первыми|

source: ACK wait timer starts
ru: 1. Брокер отправляет сообщение клиенту

source: Client processes message and sends ACK
ru: 2. Запускается таймер ожидания ACK

source: Broker receives ACK and marks message as delivered
ru: 3. Клиент обрабатывает сообщение и отправляет ACK

source: **Automatic ACKs:**
ru: **Настройка:**

source: By default, the client automatically sends ACK after successful processing:
ru: options.DefaultDeliveryMode = DeliveryMode.PriorityBased;

source: Retry Attempts
ru: **Публикация с приоритетом:**

source: If ACK is not received within the timeout, the message is resent:
ru: await client.PublishAsync("alerts", message, options => {

source: **Exponential backoff:**
ru: options.Priority = MessagePriority.Critical;

source: Attempt 1: immediately
ru: Гарантии доставки

source: Attempt 2: after 1s
ru: Подтверждения (ACK)

source: Attempt 3: after 2s
ru: VibeMQ использует механизм подтверждений для гарантии доставки:

source: Attempt 4: after 4s
ru: Брокер → Доставить сообщение → Клиент

source: **Reasons for DLQ:**
ru: ◀────── ACK ────────────┘

source: Maximum delivery attempts exceeded
ru: **Как работает:**

source: Message TTL expired
ru: 1. Брокер отправляет сообщение клиенту

source: Deserialization error
ru: 2. Запускается таймер ожидания ACK

source: Exception in handler
ru: 3. Клиент обрабатывает сообщение и отправляет ACK

source: **DLQ processing:**
ru: 4. Брокер получает ACK и помечает сообщение как доставленное

source: Queue Management
ru: **Автоматические ACK:**

source: Creating a Queue
ru: По умолчанию клиент автоматически отправляет ACK после успешной обработки:

source: **Automatic creation:**
ru: await using var subscription = await client.SubscribeAsync<dynamic>(

source: When publishing to a non-existent queue, it's created automatically:
ru: "notifications",

source: **Manual creation:**
ru: async msg => {

source: Deleting a Queue
ru: await ProcessMessageAsync(msg);

source: Getting Information
ru: // ACK отправляется автоматически

source: VibeMQ supports message priorities for important deliveries.
ru: Повторные попытки

source: **Priority levels:**
ru: Если ACK не получен в течение таймаута, сообщение отправляется повторно:

source: Active connections are maintained using the keep-alive mechanism:
ru: **Настройка:**

source: **Client configuration:**
ru: options.MaxRetryAttempts = 3;

source: Automatic Reconnections
ru: **Экспоненциальная задержка:**

source: The client automatically reconnects when the connection is lost.
ru: Между попытками используется экспоненциальная задержка:

source: **Reconnect policy configuration:**
ru: Dead Letter Queue (DLQ)

source: **Parameters:**
ru: Сообщения, которые не удалось доставить после всех попыток, перемещаются в Dead Letter Queue:

source: Parameter
ru: options.EnableDeadLetterQueue = true;

source: Default
ru: options.DeadLetterQueueName = "dead-letters";

source: ``MaxAttempts``
ru: options.MaxRetryAttempts = 3;

source: int.MaxValue
ru: **Причины попадания в DLQ:**

source: Maximum number of attempts
ru: **Обработка DLQ:**

source: ``InitialDelay``
ru: var dlqMessages = await queueManager.GetDeadLetterMessagesAsync(100);

source: 1s
ru: foreach (var message in dlqMessages) {

source: Initial delay
ru: // Повторная обработка или логирование

source: ``MaxDelay``
ru: await RetryOrLogAsync(message);

source: Maximum delay
ru: Управление очередями

source: ``UseExponentialBackoff`` | true
ru: Создание очереди

source: Exponential increase
ru: **Автоматическое создание:**

source: Authentication
ru: При публикации в несуществующую очередь она создаётся автоматически:

source: Token-based authentication:
ru: options.EnableAutoCreate = true;

source: **On server:**
ru: **Ручное создание:**

source: **On client:**
ru: await queueManager.CreateQueueAsync("my-queue", new QueueOptions {

source: Use complex tokens (32+ characters) and store them in a secure location.
ru: DeliveryMode = DeliveryMode.RoundRobin,

source: TLS/SSL Encryption
ru: MaxQueueSize = 10_000,

source: Transport encryption support:
ru: MessageTtl = TimeSpan.FromHours(1),

source: Overload protection:
ru: Удаление очереди

source: ``Enabled``
ru: await queueManager.DeleteQueueAsync("my-queue");

source: false
ru: Получение информации

source: Enable rate limiting
ru: var info = await queueManager.GetQueueInfoAsync("my-queue");

source: ``MaxConnectionsPerIpPerWindow`` | 100
ru: Console.WriteLine($"Очередь: {info.Name}");

source: Max connections per IP per window
ru: Console.WriteLine($"Сообщений: {info.MessageCount}");

source: ``ConnectionWindowSeconds`` | 60
ru: Console.WriteLine($"Подписчиков: {info.SubscriberCount}");

source: Time window (seconds)
ru: Console.WriteLine($"Режим: {info.DeliveryMode}");

source: ``MaxMessagesPerClientPerSecond`` | 1000
ru: Список очередей

source: Max messages per second per client
ru: var queues = await queueManager.ListQueuesAsync();

source: Correct server shutdown without message loss:
ru: Console.WriteLine(queueName);

source: Stop accepting new connections
ru: Приоритеты сообщений

source: Notify clients about shutdown
ru: 1. Остановка приёма новых соединений

source: Wait for in-flight message processing (up to 30s)
ru: 2. Уведомление клиентов о shutdown

source: Close all connections
ru: 3. Ожидание обработки in-flight сообщений (до 30с)

source: Clean up resources
ru: 4. Закрытие всех соединений

source: HTTP endpoints for monitoring:
ru: High = 2, // Высокий

source: **Enable:**
ru: Critical = 3 // Критический

source: ``GET /health/`` — health status (200 OK or 503)
ru: **Публикация с приоритетом:**

source: ``GET /metrics/`` — broker metrics (JSON)
ru: // Критическое сообщение

source: **Example /health/ response:**
ru: await client.PublishAsync("alerts", alertData, options => {

source: **Example /metrics/ response:**
ru: options.Priority = MessagePriority.Critical;

source: **Counters:**
ru: // Высокий приоритет

source: ``TotalMessagesPublished`` — total published
ru: await client.PublishAsync("notifications", data, options => {

source: ``TotalMessagesDelivered`` — total delivered
ru: options.Priority = MessagePriority.High;

source: ``TotalRetries`` — retry attempts
ru: // Обычный приоритет (по умолчанию)

source: ``TotalDeadLettered`` — in DLQ
ru: await client.PublishAsync("logs", logData);

source: ``TotalErrors`` — errors
ru: Keep-alive (PING/PONG)

source: ``TotalConnectionsAccepted`` — connections accepted
ru: Для поддержания активных соединений используется механизм keep-alive:

source: ``TotalConnectionsRejected`` — connections rejected
ru: Клиент Сервер

source: ``ActiveConnections`` — active connections
ru: │─── PING (30с) ─────────▶│

source: ``InFlightMessages`` — in flight
ru: │◄── PONG (немедленно) ───│

source: ``MemoryUsageBytes`` — memory usage
ru: **Настройка на клиенте:**

source: **Latency:**
ru: var client = await VibeMQClient.ConnectAsync(

source: ``AverageDeliveryLatencyMs`` — average delivery latency
ru: "localhost",

source: :doc:`server-setup` — server configuration
ru: new ClientOptions {

source: :doc:`client-usage` — client usage
ru: KeepAliveInterval = TimeSpan.FromSeconds(30)
