Repository: Bobsans/VibeMQ
Catalog: docs/locale/*/LC_MESSAGES/getting-started.po
Languages: ru

source: Quick Start
ru: Быстрый старт

source: This guide will help you quickly get started with VibeMQ — from installation to your first message.
ru: Это руководство поможет вам быстро начать работу с VibeMQ — от установки до первого сообщения.

source: Contents
ru: :local:

source: Prerequisites
ru: :depth: 2

source: **.NET 8.0 SDK** or higher
ru: Предварительные требования

source: Basic knowledge of C# and asynchronous programming
ru: Установка

source: Installation
ru: Создайте новый проект или откройте существующий:

source: Create a new project or open an existing one:
ru: Создайте новый проект или откройте существующий:

source: Install the required NuGet packages:
ru: Установите необходимые NuGet-пакеты:

source: First Server
ru: Установите необходимые NuGet-пакеты:

source: Create a ``Program.cs`` file with the server startup code:
ru: Создайте файл ``Program.cs`` с кодом запуска сервера:

source: Start the server:
ru: Запустите сервер:

source: First Client
ru: Первый сервер

source: Create a second project for the client:
ru: Создайте второй проект для клиента:

source: Edit ``Program.cs``:
ru: Отредактируйте ``Program.cs``:

source: Start the client:
ru: Запустите клиента:

source: Complete Example: Publisher and Subscriber
ru: using VibeMQ.Core.Enums;

source: Create two separate applications:
ru: Создайте два отдельных приложения:

source: **Publisher (Publisher.cs):**
ru: **Издатель (Publisher.cs):**

source: **Subscriber (Subscriber.cs):**
ru: **Подписчик (Subscriber.cs):**

source: Start the subscriber first, then the publisher, and send a few messages.
ru: Запустите сначала подписчика, затем издателя и отправьте несколько сообщений.

source: Next Steps
ru: var broker = BrokerBuilder.Create()

source: Now that you're familiar with the basics, you can explore:
ru: Теперь, когда вы познакомились с основами, вы можете изучить:

source: :doc:`architecture` — how VibeMQ works internally
ru: .UseAuthentication("my-secret-token")

source: :doc:`features` — detailed overview of all features
ru: .ConfigureQueues(options => {

source: :doc:`server-setup` — detailed server configuration
ru: options.DefaultDeliveryMode = DeliveryMode.RoundRobin;

source: :doc:`client-usage` — advanced client usage
ru: options.MaxQueueSize = 10_000;

source: :doc:`configuration` — all configuration parameters
ru: options.EnableAutoCreate = true;
