Repository: Bobsans/VibeMQ
Catalog: docs/locale/*/LC_MESSAGES/health-checks.po
Languages: ru

source: This guide describes using health checks for monitoring and orchestration.
ru: Это руководство описывает использование health checks для мониторинга и оркестрации.

source: Contents
ru: :local:

source: Overview
ru: :depth: 2

source: VibeMQ provides HTTP endpoints for server health checks. These are used by orchestrators (Kubernetes, Docker Swarm) to determine service state.
ru: VibeMQ предоставляет HTTP эндпоинты для проверки здоровья сервера. Это используется оркестраторами (Kubernetes, Docker Swarm) для определения состояния сервиса.

source: Enabling Health Checks
ru: VibeMQ предоставляет HTTP эндпоинты для проверки здоровья сервера. Это используется оркестраторами (Kubernetes, Docker Swarm) для определения состояния сервиса.

source: Configuration Parameters
ru: Включение health checks

source: Endpoints
ru: using VibeMQ.Health;

source: Server health check.
ru: Проверка здоровья сервера.

source: **Request:**
ru: .ConfigureHealthChecks(options => {

source: **Response (healthy):**
ru: **Ответ (здоров):**

source: **Status code:** ``200 OK``
ru: **Код состояния:** ``200 OK``

source: **Response (unhealthy):**
ru: **Ответ (нездоров):**

source: **Status code:** ``503 Service Unavailable``
ru: **Код состояния:** ``503 Service Unavailable``

source: **Health criteria:**
ru: **Критерии здоровья:**

source: ``healthy`` — memory usage < 90%
ru: | Параметр | По умолчанию | Описание |

source: ``unhealthy`` — memory usage >= 90%
ru: | ``Enabled`` | true | Включить health check сервер |

source: Get detailed metrics.
ru: Получение подробных метрик.

source: **Response:**
ru: **Ответ:**

source: Using with Orchestrators
ru: Проверка здоровья сервера.

source: **Deployment with health checks:**
ru: **Deployment с health checks:**

source: **Probe descriptions:**
ru: **Описание probes:**

source: **readinessProbe** — determines if container is ready to accept traffic
ru: "status": "healthy",

source: **Parameters:**
ru: **Параметры:**

source: ``initialDelaySeconds`` — delay before first check
ru: "queue_count": 5,

source: ``periodSeconds`` — interval between checks
ru: "memory_usage_mb": 256

source: ``failureThreshold`` — number of failed attempts
ru: **Код состояния:** ``200 OK``

source: Monitoring Health Checks
ru: "queue_count": 0,

source: Manual Check
ru: "memory_usage_mb": 512

source: Automatic Monitoring
ru: **Код состояния:** ``503 Service Unavailable``

source: **Bash script:**
ru: **Bash скрипт:**

source: **Python script:**
ru: **Python скрипт:**

source: Integration with Monitoring Systems
ru: Получение подробных метрик.

source: Import dashboard for visualizing VibeMQ metrics.
ru: Импортируйте дашборд для визуализации метрик VibeMQ.

source: **Main panels:**
ru: **Основные панели:**

source: Health status (health check)
ru: "total_messages_delivered": 124850,

source: Active connections
ru: "total_messages_acknowledged": 124800,

source: Queue count
ru: "total_retries": 150,

source: Memory usage
ru: "total_dead_lettered": 50,

source: Message throughput
ru: "total_errors": 5,

source: Delivery latency
ru: "total_connections_accepted": 500,

source: **Agent configuration:**
ru: **Конфигурация agent:**

source: Use Prometheus endpoint for integration:
ru: Используйте Prometheus endpoint для интеграции:

source: Troubleshooting
ru: "memory_usage_bytes": 268435456,

source: Health check not responding
ru: "average_delivery_latency_ms": 2.5,

source: **Problem:** ``curl: (7) Failed to connect to localhost port 8081``
ru: **Проблема:** ``curl: (7) Failed to connect to localhost port 8081``

source: Health check disabled
ru: Использование с оркестраторами

source: Wrong port
ru: Kubernetes

source: Firewall blocking
ru: **Deployment с health checks:**

source: **Solution:**
ru: apiVersion: apps/v1

source: Returns 503
ru: kind: Deployment

source: **Problem:** Health check returns ``503 Service Unavailable``
ru: **Проблема:** Health check возвращает ``503 Service Unavailable``

source: **Cause:** Critical memory usage (>90%)
ru: **Причина:** Критическое использование памяти (>90%)

source: Increase memory limit
ru: 1. Увеличьте лимит памяти

source: Reduce queue sizes
ru: 2. Уменьшите размер очередей

source: Optimize memory usage
ru: 3. Оптимизируйте использование памяти

source: Health check timeout
ru: matchLabels:

source: **Problem:** ``curl: (28) Operation timed out``
ru: **Проблема:** ``curl: (28) Operation timed out``

source: Server overloaded
ru: template:

source: Wrong timeout
ru: metadata:

source: **Solution:** Increase timeout in orchestrator configuration:
ru: **Решение:** Увеличьте таймаут в конфигурации оркестратора:

source: Next Steps
ru: app: vibemq

source: :doc:`monitoring` — monitoring and metrics
ru: spec:

source: :doc:`troubleshooting` — troubleshooting
ru: containers:

source: :doc:`configuration` — configuration
ru: image: vibemq-server:latest
