Repository: Bobsans/VibeMQ
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: ru

source: Getting Started
ru: Начало работы

source: Core Concepts
ru: Основы

source: Setup & Usage
ru: Настройка и использование

source: Monitoring & Operations
ru: Мониторинг и обслуживание

source: Additional Resources
ru: Дополнительно

source: VibeMQ — .NET Message Broker
ru: VibeMQ — Месседж-брокер на .NET

source: **VibeMQ** is a simple yet reliable message broker for .NET applications using TCP as transport. It supports publish/subscribe (pub/sub), queues with delivery guarantees, automatic reconnections, and other essential features for building distributed systems.
ru: **VibeMQ** — это простой, но надёжный месседж-брокер для .NET приложений с использованием TCP в качестве транспорта. Он поддерживает публикацию/подписку (pub/sub), очереди с гарантией доставки, автоматические реконнекты и другие важные функции для построения распределённых систем.

source: Contents
ru: Содержание

source: 🚀 Quick Start
ru: 🚀 Быстрый старт

source: Install via NuGet:
ru: Установка через NuGet:

source: Start the server:
ru: Запуск сервера:

source: Connect the client:
ru: Подключение клиента:

source: 📋 Table of Contents
ru: 📋 Оглавление

source: 🎯 Key Features
ru: 🎯 Ключевые возможности

source: **Message Delivery Modes:**
ru: **Режимы доставки сообщений:**

source: **Round-robin** — each message delivered to one subscriber (cyclically)
ru: **Round-robin** — каждое сообщение доставляется одному подписчику (циклически)

source: **Fan-out with acknowledgment** — to all subscribers with delivery guarantee
ru: **Fan-out с подтверждением** — всем подписчикам с гарантией доставки

source: **Fan-out without acknowledgment** — to all subscribers without confirmation
ru: **Fan-out без подтверждения** — всем подписчикам без подтверждения

source: **Priority-based** — delivery by priority (Critical > High > Normal > Low)
ru: **Priority-based** — доставка по приоритету (Critical > High > Normal > Low)

source: **Delivery Guarantees:**
ru: **Гарантии доставки:**

source: Acknowledgments (ACK) from receivers
ru: Подтверждения (ACK) от получателей

source: Automatic retry attempts with exponential backoff
ru: Автоматические повторные попытки с экспоненциальной задержкой

source: Dead Letter Queue for failed messages
ru: Dead Letter Queue для неудачных сообщений

source: In-flight message tracking
ru: Отслеживание неподтверждённых сообщений

source: **Reliability:**
ru: **Надёжность:**

source: Keep-alive (PING/PONG) for connection maintenance
ru: Keep-alive (PING/PONG) для поддержания соединений

source: Automatic reconnections on client side
ru: Автоматические реконнекты на стороне клиента

source: Graceful shutdown without message loss
ru: Graceful shutdown без потери сообщений

source: Health checks for orchestrators
ru: Health checks для оркестраторов

source: **Security:**
ru: **Безопасность:**

source: Token-based authentication
ru: Токен-базированная аутентификация

source: TLS/SSL encryption support
ru: Поддержка TLS/SSL шифрования

source: Rate limiting for overload protection
ru: Rate limiting для защиты от перегрузок

source: **Monitoring:**
ru: **Мониторинг:**

source: Built-in performance metrics
ru: Встроенные метрики производительности

source: HTTP endpoints for health checks
ru: HTTP эндпоинты для health checks

source: Statistics for queues and connections
ru: Статистика по очередям и подключениям

source: 📦 Modular Architecture
ru: 📦 Модульная архитектура

source: VibeMQ consists of several NuGet packages:
ru: VibeMQ состоит из нескольких NuGet-пакетов:

source: 💡 Usage Examples
ru: 💡 Примеры использования

source: Server with Dependency Injection:
ru: Сервер с Dependency Injection:

source: Client with Dependency Injection:
ru: Клиент с Dependency Injection:

source: 🔗 Links
ru: 🔗 Ссылки

source: `GitHub Repository <https://github.com/DarkBoy/VibeMQ>`_
ru: `GitHub репозиторий <https://github.com/DarkBoy/VibeMQ>`_

source: `NuGet Packages <https://www.nuget.org/packages?q=VibeMQ>`_
ru: `NuGet пакеты <https://www.nuget.org/packages?q=VibeMQ>`_

source: `Issues & Feature Requests <https://github.com/DarkBoy/VibeMQ/issues>`_
ru: `Issues и предложения <https://github.com/DarkBoy/VibeMQ/issues>`_

source: 📄 License
ru: 📄 Лицензия

source: VibeMQ is distributed under the MIT License. See LICENSE file for details.
ru: VibeMQ распространяется под лицензией MIT. Подробности см. в файле LICENSE.
