Repository: Bobsans/VibeMQ
Catalog: docs/locale/*/LC_MESSAGES/monitoring.po
Languages: ru

source: Monitoring
ru: Мониторинг

source: This guide describes monitoring capabilities and health checks in VibeMQ.
ru: Это руководство описывает возможности мониторинга и health checks в VibeMQ.

source: Contents
ru: :local:

source: VibeMQ provides HTTP endpoints for health checks and metrics.
ru: VibeMQ предоставляет HTTP эндпоинты для проверки здоровья и получения метрик.

source: Enabling Health Checks
ru: VibeMQ предоставляет HTTP эндпоинты для проверки здоровья и получения метрик.

source: Endpoints
ru: Включение health checks

source: Returns server health status.
ru: Возвращает статус здоровья сервера.

source: **Request:**
ru: options.Port = 8081;

source: **Response (200 OK):**
ru: **Ответ (200 OK):**

source: **Response (503 Service Unavailable):**
ru: **Ответ (503 Service Unavailable):**

source: **Status codes:**
ru: **Коды состояния:**

source: ``503 Service Unavailable`` — server unhealthy (critical memory usage)
ru: Возвращает статус здоровья сервера.

source: Returns detailed server metrics.
ru: Возвращает подробные метрики сервера.

source: **Response:**
ru: **Ответ:**

source: Counters
ru: "status": "healthy",

source: Counters only increase and show accumulated values.
ru: Счётчики только увеличиваются и показывают накопленные значения.

source: **Type:** ``long``
ru: "memory_usage_mb": 256

source: **Description:** Total number of published messages.
ru: **Описание:** Общее количество опубликованных сообщений.

source: **Usage:**
ru: **Ответ (503 Service Unavailable):**

source: Calculate throughput (messages/sec)
ru: "status": "unhealthy",

source: **Description:** Total number of delivered messages.
ru: **Описание:** Общее количество доставленных сообщений.

source: Monitor delivery success rate
ru: "memory_usage_mb": 512

source: **Description:** Total number of acknowledged messages.
ru: **Описание:** Общее количество подтверждённых сообщений.

source: Identify acknowledgment issues
ru: Возвращает подробные метрики сервера.

source: **Description:** Total number of delivery retries.
ru: **Описание:** Общее количество повторных попыток доставки.

source: Identify delivery issues
ru: **Ответ:**

source: **Description:** Number of messages in Dead Letter Queue.
ru: **Описание:** Количество сообщений в Dead Letter Queue.

source: Monitor failed deliveries
ru: "total_messages_acknowledged": 124800,

source: Requires attention when growing
ru: "total_retries": 150,

source: **Description:** Total number of errors.
ru: **Описание:** Общее количество ошибок.

source: Overall system health indicator
ru: "total_connections_accepted": 500,

source: Requires investigation when growing
ru: "total_connections_rejected": 10,

source: **Description:** Number of accepted connections.
ru: **Описание:** Количество принятых подключений.

source: Monitor server load
ru: "in_flight_messages": 42,

source: Resource planning
ru: "memory_usage_bytes": 268435456,

source: **Description:** Number of rejected connections.
ru: **Описание:** Количество отклонённых подключений.

source: Configure rate limiting
ru: Метрики

source: Gauge Metrics
ru: Счётчики (Counters)

source: Gauge metrics can increase and decrease, showing current state.
ru: Gauge-метрики могут увеличиваться и уменьшаться, показывая текущее состояние.

source: **Description:** Current number of active connections.
ru: **Описание:** Текущее количество активных подключений.

source: **Normal values:** Depends on load
ru: **Описание:** Общее количество опубликованных сообщений.

source: **Alert:** Approaching ``MaxConnections``
ru: **Тревога:** Приближение к ``MaxConnections``

source: **Description:** Current number of active queues.
ru: **Описание:** Текущее количество активных очередей.

source: Monitor queue usage
ru: **Тип:** ``long``

source: Identify unused queues
ru: **Описание:** Общее количество доставленных сообщений.

source: **Description:** Number of messages in processing (waiting for ACK).
ru: **Описание:** Количество сообщений в обработке (ожидающих ACK).

source: **Alert:** High values may indicate: - Handler issues - Slow subscribers - Network problems
ru: **Тревога:** Высокие значения могут указывать на:

source: **Description:** Current memory usage in bytes.
ru: **Описание:** Текущее использование памяти в байтах.

source: **Normal values:** < 80% of available memory
ru: **Нормальные значения:** < 80% от доступной памяти

source: **Alert:** > 90% — possible backpressure
ru: **Тревога:** > 90% — возможен backpressure

source: **Type:** ``double``
ru: **Тип:** ``double``

source: **Description:** Average message delivery latency (ms).
ru: **Описание:** Средняя задержка доставки сообщений (мс).

source: **Normal values:** < 10 ms
ru: **Нормальные значения:** < 10 мс

source: **Alert:** > 50 ms — requires optimization
ru: **Тревога:** > 50 мс — требует оптимизации

source: Monitoring with Prometheus
ru: **Тип:** ``long``

source: Example metrics exporter:
ru: Пример экспортера метрик:

source: Registration:
ru: Регистрация:

source: Grafana Dashboard
ru: TotalErrors

source: Example JSON dashboard for Grafana:
ru: Пример JSON-дашборда для Grafana:

source: Logging
ru: **Тип:** ``long``

source: Logging Configuration
ru: **Описание:** Общее количество ошибок.

source: Log Levels
ru: **Использование:**

source: For protocol debugging
ru: **Тип:** ``long``

source: Connection information
ru: **Использование:**

source: Operation status
ru: TotalConnectionsRejected

source: Server start/stop
ru: **Тип:** ``long``

source: Queue creation/deletion
ru: **Описание:** Количество отклонённых подключений.

source: Authentication errors
ru: **Использование:**

source: Limit exceeded
ru: Gauge-метрики могут увеличиваться и уменьшаться, показывая текущее состояние.

source: Delivery issues
ru: ActiveConnections

source: Message processing errors
ru: **Описание:** Текущее количество активных подключений.

source: Connection errors
ru: **Нормальные значения:** Зависит от нагрузки

source: Handler exceptions
ru: **Тревога:** Приближение к ``MaxConnections``

source: Unable to start
ru: **Тип:** ``int``

source: Data loss
ru: **Описание:** Текущее количество активных очередей.

source: Log Examples
ru: **Использование:**

source: **Server startup:**
ru: **Запуск сервера:**

source: **Client connection:**
ru: **Подключение клиента:**

source: **Message publishing:**
ru: **Публикация сообщения:**

source: **Warnings:**
ru: **Предупреждения:**

source: **Errors:**
ru: **Ошибки:**

source: Alerting
ru: **Тревога:** Высокие значения могут указывать на:

source: Example rules for Prometheus Alertmanager:
ru: Примеры правил для Prometheus Alertmanager:

source: :doc:`server-setup` — server setup
ru: **Тип:** ``long``

source: :doc:`troubleshooting` — troubleshooting
ru: **Описание:** Текущее использование памяти в байтах.

source: :doc:`health-checks` — health checks for orchestrators
ru: **Нормальные значения:** < 80% от доступной памяти
