Repository: Bobsans/VibeMQ
Catalog: docs/locale/*/LC_MESSAGES/server-setup.po
Languages: ru

source: Server Setup
ru: Настройка сервера

source: This guide describes various ways to configure and run the VibeMQ server.
ru: Это руководство описывает различные способы настройки и запуска сервера VibeMQ.

source: Contents
ru: :local:

source: Basic Configuration
ru: :depth: 2

source: Minimal Configuration
ru: Базовая настройка

source: Simplest way to start server:
ru: Самый простой способ запустить сервер:

source: This code will start server on port 8080 without authentication and with default settings.
ru: Этот код запустит сервер на порту 8080 без аутентификации и с настройками по умолчанию.

source: Advanced Configuration
ru: using VibeMQ.Server;

source: Configuration Parameters
ru: var broker = BrokerBuilder.Create()

source: Basic Parameters
ru: .UsePort(8080)

source: Default Queue Settings
ru: .Build();

source: TLS/SSL Settings
ru: Этот код запустит сервер на порту 8080 без аутентификации и с настройками по умолчанию.

source: Health Check Settings
ru: Расширенная конфигурация

source: Delivery Modes
ru: using Microsoft.Extensions.Logging;

source: Each message is delivered to one subscriber cyclically:
ru: using VibeMQ.Core.Enums;

source: **Usage:**
ru: using var loggerFactory = LoggerFactory.Create(builder => {

source: Task processing by multiple workers
ru: builder.SetMinimumLevel(LogLevel.Information).AddConsole();

source: Task queues
ru: var broker = BrokerBuilder.Create()

source: Fan-out with Acknowledgment
ru: .UsePort(8080)

source: Message delivered to all subscribers with delivery guarantee:
ru: .UseAuthentication("my-secret-token")

source: Notification broadcasting
ru: .UseMaxConnections(1000)

source: Data replication
ru: .UseMaxMessageSize(1_048_576) // 1 MB

source: Audit and logging
ru: .ConfigureQueues(options => {

source: Fan-out without Acknowledgment
ru: options.DefaultDeliveryMode = DeliveryMode.RoundRobin;

source: Message delivered to all subscribers without acknowledgment:
ru: options.MaxQueueSize = 10_000;

source: Broadcast messages
ru: options.EnableAutoCreate = true;

source: Real-time updates
ru: options.MessageTtl = TimeSpan.FromHours(24);

source: Data streaming
ru: options.EnableDeadLetterQueue = true;

source: **Priorities:**
ru: .ConfigureRateLimiting(options => {

source: ``Critical`` — critical (delivered first)
ru: options.Enabled = true;

source: ``High`` — high
ru: options.MaxConnectionsPerIpPerWindow = 50;

source: ``Normal`` — normal (default)
ru: options.MaxMessagesPerClientPerSecond = 1000;

source: **Publishing example:**
ru: .ConfigureHealthChecks(options => {

source: Overflow Strategies
ru: options.Enabled = true;

source: **When to use:**
ru: .UseTls(options => {

source: Fresh data is important
ru: options.Enabled = false; // Включите для production

source: Old messages lose relevance
ru: options.CertificatePath = "/path/to/cert.pfx";

source: All existing messages are important
ru: .UseLoggerFactory(loggerFactory)

source: New messages can wait
ru: .Build();

source: Block publisher until space is available:
ru: Параметры конфигурации

source: Message loss is unacceptable
ru: Основные параметры

source: Publisher can wait
ru: | Параметр | По умолчанию | Описание |

source: Redirect to Dead Letter Queue:
ru: | ``MaxConnections`` | 1000 | Максимальное количество подключе-|

source: All messages must be preserved
ru: | | | ний |

source: Subsequent processing planned
ru: | ``MaxMessageSize`` | 1 MB | Максимальный размер сообщения |

source: DLQ Configuration:
ru: | ``AuthToken`` | null | Токен для аутентификации |

source: **Reasons for DLQ:**
ru: Настройки очередей по умолчанию

source: Exceeded maximum delivery attempts
ru: | Параметр | По умолчанию | Описание |

source: Message TTL expired
ru: | ``DefaultDeliveryMode``| RoundRobin | Режим доставки по умолчанию |

source: Deserialization error
ru: | ``MaxQueueSize`` | 10,000 | Максимальный размер очереди |

source: Exception in handler
ru: | ``EnableAutoCreate`` | true | Автоматическое создание очередей |

source: **Getting messages from DLQ:**
ru: | ``MessageTtl`` | null | Время жизни сообщений (TTL) |

source: Authentication
ru: | ``EnableDeadLetterQueue`` | false | Включить DLQ |

source: Enabling Authentication:
ru: | ``MaxRetryAttempts`` | 3 | Макс. попыток доставки |

source: **On client:**
ru: | ``OverflowStrategy`` | DropOldest | Стратегия переполнения |

source: Use complex tokens in production (minimum 32 characters). Store tokens securely (Azure Key Vault, AWS Secrets Manager, HashiCorp Vault).
ru: Rate limiting

source: TLS/SSL Encryption
ru: | Параметр | По умолчанию | Описание |

source: TLS Configuration:
ru: | ``Enabled`` | false | Включить rate limiting |

source: **Creating self-signed certificate (for tests):**
ru: | ``MaxConnectionsPerIpPerWindow`` | 100 | Макс. подключений с IP в окно |

source: Do not use ``SkipCertificateValidation = true`` in production!
ru: | ``ConnectionWindowSeconds`` | 60 | Окно времени для подключений (с) |

source: Starting and Stopping
ru: | ``MaxMessagesPerClientPerSecond`` | 1000 | Макс. сообщений от клиента в сек |

source: Starting Server
ru: TLS/SSL настройки

source: **Async start:**
ru: | Параметр | По умолчанию | Описание |

source: **Start with signal handling:**
ru: | ``Enabled`` | false | Включить TLS |

source: Stopping Server
ru: | ``CertificatePath`` | null | Путь к PFX-сертификату |

source: **Graceful stop:**
ru: | ``CertificatePassword``| null | Пароль к сертификату |

source: **Resource cleanup:**
ru: Health check настройки

source: **Using statement:**
ru: | Параметр | По умолчанию | Описание |

source: Logging
ru: | ``Enabled`` | true | Включить health check сервер |

source: Logging Configuration:
ru: | ``Port`` | 8081 | HTTP порт для health checks |

source: **Log levels:**
ru: Режимы доставки

source: ``Trace`` — detailed debugging
ru: Round-robin

source: ``Debug`` — debug information
ru: Каждое сообщение доставляется одному подписчику циклически:

source: ``Information`` — informational messages
ru: .ConfigureQueues(options => {

source: ``Warning`` — warnings
ru: options.DefaultDeliveryMode = DeliveryMode.RoundRobin;

source: ``Critical`` — critical errors
ru: **Использование:**

source: Configuration Examples
ru: Fan-out с подтверждением

source: Minimal Server for Development
ru: Сообщение доставляется всем подписчикам с гарантией доставки:

source: Production Server
ru: .ConfigureQueues(options => {

source: Microservices Server
ru: options.DefaultDeliveryMode = DeliveryMode.FanOutWithAck;

source: IoT Server
ru: options.MaxRetryAttempts = 3;

source: :doc:`client-usage` — client usage
ru: **Использование:**

source: :doc:`configuration` — detailed configuration
ru: Fan-out без подтверждения

source: :doc:`monitoring` — monitoring and health checks
ru: Сообщение доставляется всем подписчикам без подтверждения:

source: :doc:`di-integration` — DI integration
ru: .ConfigureQueues(options => {
