Repository: Bobsans/VibeMQ
Catalog: docs/locale/*/LC_MESSAGES/troubleshooting.po
Languages: ru

source: Troubleshooting
ru: Устранение проблем

source: This guide will help solve common problems when using VibeMQ.
ru: Это руководство поможет решить распространённые проблемы при использовании VibeMQ.

source: Contents
ru: :local:

source: Connection Issues
ru: :depth: 2

source: "Connection refused"
ru: Проблемы подключения

source: **Error:**
ru: «Connection refused»

source: **Causes:**
ru: **Ошибка:**

source: Server not running
ru: 1. Сервер не запущен

source: Wrong port
ru: 2. Неверный порт

source: Firewall blocking connection
ru: 3. Брандмауэр блокирует подключение

source: Server listening only on localhost
ru: 4. Сервер слушает только localhost

source: **Solution:**
ru: 3. Брандмауэр блокирует подключение

source: **Check:**
ru: 4. Сервер слушает только localhost

source: "Connection timeout"
ru: **Решение:**

source: Network latency
ru: 1. Сетевая задержка

source: Server overloaded
ru: 2. Сервер перегружен

source: Wrong timeout
ru: 3. Неправильный таймаут

source: "Host unreachable"
ru: .Build();

source: Wrong host
ru: 1. Неправильный хост

source: Network issues
ru: // Проверьте, что клиент подключается к правильному порту

source: DNS not resolving
ru: 3. DNS не разрешается

source: **DNS check:**
ru: **Проверка DNS:**

source: Authentication Issues
ru: netstat -an | grep 8080

source: "Authentication failed"
ru: Get-NetTCPConnection -LocalPort 8080

source: **Cause:** Tokens on server and client do not match.
ru: **Причина:** Токены на сервере и клиенте не совпадают.

source: Tokens are case-sensitive!
ru: Токены чувствительны к регистру!

source: "Authentication required"
ru: System.TimeoutException: Connection timeout

source: **Cause:** Server requires authentication, but client did not provide token.
ru: **Причина:** Сервер требует аутентификацию, но клиент не предоставил токен.

source: Queue Issues
ru: 1. Сетевая задержка

source: "Queue not found"
ru: 2. Сервер перегружен

source: Queue does not exist
ru: 1. Очередь не существует

source: Auto-create disabled
ru: 2. Отключено авто-создание

source: **Solution 1:** Enable auto-create:
ru: **Решение 1:** Включите авто-создание:

source: **Solution 2:** Create queue manually:
ru: **Решение 2:** Создайте очередь вручную:

source: **Cause:** Attempting to create existing queue.
ru: **Причина:** Попытка создать существующую очередь.

source: Message Delivery Issues
ru: CommandTimeout = TimeSpan.FromSeconds(30) // Увеличьте таймаут

source: **Problem:** Messages are published but subscribers do not receive them.
ru: **Проблема:** Сообщения публикуются, но подписчики не получают.

source: **Possible causes:**
ru: **Возможные причины:**

source: Subscriber not subscribed to queue
ru: 1. Подписчик не подписан на очередь

source: Wrong queue name
ru: 2. Неправильное имя очереди

source: Slow Message Delivery
ru: **Причины:**

source: **Problem:** High delivery latency.
ru: **Проблема:** Высокая латентность доставки.

source: Server overload
ru: 1. Перегрузка сервера

source: Slow handlers
ru: 2. Медленные обработчики

source: Network delays
ru: 3. Сетевые задержки

source: **Monitor latency:**
ru: **Мониторинг латентности:**

source: "Message timeout"
ru: var client = await VibeMQClient.ConnectAsync(

source: **Cause:** Subscriber did not send ACK within timeout.
ru: **Причина:** Подписчик не отправил ACK в течение таймаута.

source: Queues too large
ru: 1. Слишком большие очереди

source: Many unacknowledged messages
ru: 2. Много неподтверждённых сообщений

source: Memory leaks
ru: 3. Утечки памяти

source: **Monitor memory:**
ru: **Мониторинг памяти:**

source: **Problem:** Publications are blocked.
ru: **Проблема:** Публикации блокируются.

source: **Cause:** Backpressure enabled due to high memory usage.
ru: **Причина:** Включён backpressure из-за высокого использования памяти.

source: Reconnection Issues
ru: **Причина:** Токены на сервере и клиенте не совпадают.

source: Frequent Disconnections
ru: **Решение:**

source: **Problem:** Client frequently disconnects.
ru: **Проблема:** Клиент часто отключается.

source: Server restarting
ru: 2. Сервер перезапускается

source: Keep-alive timeout
ru: 3. Таймаут keep-alive

source: "Max reconnect attempts exceeded"
ru: .Build();

source: **Cause:** Reconnection attempts exhausted.
ru: **Причина:** Исчерпаны попытки переподключения.

source: TLS/SSL Issues
ru: var client = await VibeMQClient.ConnectAsync(

source: "Certificate validation failed"
ru: "localhost",

source: Self-signed certificate
ru: 1. Самоподписанный сертификат

source: Certificate expired
ru: 2. Истёк срок действия

source: Wrong hostname
ru: 3. Неправильное имя хоста

source: **Solution (tests only):**
ru: **Решение (только для тестов):**

source: **Solution (production):**
ru: **Решение (для production):**

source: Do not use ``SkipCertificateValidation = true`` in production!
ru: Не используйте ``SkipCertificateValidation = true`` в production!

source: "TLS handshake failed"
ru: «Authentication required»

source: Server not configured for TLS
ru: 1. Сервер не настроен на TLS

source: Wrong certificate
ru: 2. Неправильный сертификат

source: Rate Limiting Issues
ru: **Причина:** Сервер требует аутентификацию, но клиент не предоставил токен.

source: "Rate limit exceeded"
ru: **Решение:**

source: **Cause:** Message limit exceeded.
ru: **Причина:** Превышен лимит сообщений.

source: "Too many connections"
ru: "localhost",

source: **Cause:** Connection limit exceeded.
ru: **Причина:** Превышен лимит подключений.

source: Diagnostics
ru: new ClientOptions {

source: Enabling Verbose Logging
ru: AuthToken = "my-token" // Предоставьте токен

source: Connection Check
ru: Проблемы с очередями

source: Next Steps
ru: «Queue not found»

source: :doc:`monitoring` — monitoring
ru: **Ошибка:**

source: :doc:`health-checks` — health checks
ru: Queue not found: notifications

source: :doc:`configuration` — configuration
ru: **Причины:**
